      *    ///////////////////// MAIN FUNCTION /////////////////////////
           IDENTIFICATION DIVISION.
             PROGRAM-ID. 'MAIN'.

           DATA DIVISION.
            WORKING-STORAGE SECTION.

           PROCEDURE DIVISION.
            
            DISPLAY "************ CAESAR CIPHER TEST SUITE ************"
            DISPLAY " "
            CALL "CAESAR-CIPHER-TEST-SUITE".

            EXIT PROGRAM.
               
           END PROGRAM 'MAIN'.

      *    ///////////////// END OF MAIN FUNCTION //////////////////////
